[GrenadeLauncher_BM X2GrenadeLauncherTemplate]
FriendlyName="Beam Grenade Launcher"
FriendlyNamePlural="Beam Grenade Launchers"
BriefSummary="The Beam Grenade Launcher combines our latest breakthroughs in beam technology-based propulsion and AI-assisted targeting systems to deliver payloads with unprecedented precision."
TacticalText="<Bullet/> The Beam Grenade Launcher transforms any grenade into an autonomous projectile that can navigate around obstacles with ease."

[GrenadeLauncher_BM_Schematic X2SchematicTemplate]
m_strClassLabel="GRENADIER"